/*************************************************************************
    > File Name: 14.c
    > Author: ma6174
    > Mail: ma6174@163.com 
    > Created Time: 2016年02月26日 星期五 21时05分25秒
 ************************************************************************/

#include<stdio.h>

int main()
{
	int a, b, c; 
	int m[12];
	int s = 0;

	printf("输入年月日，用空格隔开\n");
	scanf("%d%d%d",&a, &b, &c);
	
	if (a % 4 == 0 && a % 100 != 0 || a % 400 == 0)
	{
		int m[] = {31,29,31,30,31,30,31,31,30,31,30,31};
	}
	else
	{
		int m[12] = {31,28,31,30,31,30,31,31,30,31,30,31};
	}

	for (int i = 0; i < b - 1; i++)
		s = s + m[i];
	s = s + c;
	printf("这是这一年的第%d天\n", s);
	return 0;
}
