/*************************************************************************
    > File Name: 20.c
    > Author: ma6174
    > Mail: ma6174@163.com 
    > Created Time: 2016年03月03日 星期四 21时33分19秒
原理:
插入排序的改进版，是基于插入排序的以下俩点性质而提出的改进方法：

插入排序对几乎已排好序的数据操作时，效率很高，可以达到线性排序的效率。
但插入排序在每次往前插入时只能将数据移动一位，效率比较低。
所以希尔排序的思想是：

先是取一个合适的gap<n作为间隔，将全部元素分为gap个子序列，所有距离为gap的元素放入同一个子序列，再对每个子序列进行直接插入排序；
缩小间隔gap，例如去gap=ceil(gap/2)，重复上述子序列划分和排序
直到，最后gap=1时，将所有元素放在同一个序列中进行插入排序为止。

性能:

开始时，gap取值较大，子序列中的元素较少，排序速度快，克服了直接插入排序的缺点；其次，gap值逐渐变小后，虽然子序列的元素逐渐变多，但大多元素已基本有序，所以继承了直接插入排序的优点，能以近线性的速度排好序。

 ************************************************************************/

#include<stdio.h>

void shsort(int s[], int n)
{
	int i, j, d;
	d = n / 2;
	while (d >= 1)
	{
		for (i = d + 1; i <= n; i++)
		{
			s[0] = s[i];
			j = i - d;
			while ((j > 0) && (s[0] < s[j]))
			{
				s[j + d] = s[j];
				j = j - d;
			}
			s[j + d] = s[0];
		}
		d = d / 2;
	}
}

void main()
{
	int	i, a[11];
	printf("请输入10个数据：\n");
	for (i = 1; i <= 10; i++)
		scanf("%d",&a[i]);
	shsort(a, 10);
	printf("排序后的顺序是：\n");
	for (i = 1; i <= 10; i++)
		printf("%5d",a[i]);
	printf("\n");

}
